//: [Previous](@previous)

import Foundation

// Protocols

/*
 Protocol - წარმოადგენს მეთოდების, property-ების, და მოთხოვნების Blueprint-ს. მარტივად რომ ვთქვათ, პროტოკოლი არის გაწერილი მოთხოვნა, რომელიც უნდა დააწმაყოფილოს იმ კლასსმა, სტრუქტურამ, enumeration, ტიპემბა რომელიც მიიღებს ამ პროტოკოლს.
 პროტოკოლების საუკეთესო ნაწილი ის არის რომ შეგიძლია მისი გაფართოვება. ერთი პროტოკოლის შექმნის შემდეგ რომელიც გარჯვეულ მოთხოვნებს შეიცავს, შეგილია გააკეთო მისი გაფართოება და დაამატო სხვა მოთხოვნა ან ფუნქცია. ამით გექნება მეტი მოქნილობა.
 */

//ძირითადი სინტაქსი:
protocol SomeProtocol {
    // პროტოკოლებს ისე ვწერთ, როგორც კლასს სტრუქტურას ან ენამს
}
// როდესაც ქასთომ ტიპი იღებს პროტოკოლს განისაზღვრება ასეთი სინტაქსით
struct SomeStructure: SomeProtocol {

}
// თუ რამდენიმე პროტოკოლია მათი მძიმით გამოყოფა ხდება მაგალითად :
//struct SomeStructure: FirstProtocol, AnotherProtoco {}

