//
//  DataPersistenceOptionsApp.swift
//  DataPersistenceOptions
//
//  Created by Nino Kurshavishvili on 25.06.25.
//

import SwiftUI
// რა არის Data persistence-ის როლი iOS აპლიკაციებისთვის?

/**
 აპლიკაციებში მონაცემების ეფექტურად შენახვა და მართვა, მნიშვნელოვანი და ერთ-ერთი გადამწყვეტი ასპექტია. (და ასევე ერთ-ერთი chalanging part არის დეველოპერებისთვის)
 "Persistence Storage" - ანუ მუდმივი შენახვა - აპლიკაციებში უზრუნველყოფს მონაცემების შენახვის და ამოღების პროცესს, აპლიკაციის დახურვის, მოწყობილობის გამორთვის, გადატვირთვის შემდეგ. ანუ data persistence ძირითადად ემსახურება მაგ პროცესს,  რომ მონაცემები ყოველთვის ხელმისაწვდომი იყოს უზერისთვის.
 
 Data persistence-ის როლი არის ის, რომ მომხმარებელს საშუალება მივცეთ შეინახონ თავისი პროგრესი, პარამეტრები, ცვლილებები და აპლიკაცია ამiთ უფრო მოხერხებული გავხადოთ. მაგალითად ოფლაინ ფუნქციონირებისთვის, საჭირო მონაცემების ლოკალურად შენახვისთვის, და მოკლედ ბევრ საჭიროებას აგვარებს.
 
 აქ განვიხილავთ მონაცემების მუდმივი შენახვის მაგალითებს.
 
*/
@main
struct DataPersistenceOptionsApp: App {
    var body: some Scene {
        WindowGroup {
            UserDefaultsExampleView()
        }
    }
}

