//
//  OSLogsExample.swift
//  DataPersistenceOptions
//
//  Created by Nino Kurshavishvili on 26.06.25.
//

//რა არის OSLog

/*
 OSLog არის Apple-ის მიერ iOS 10-ში დანერგილი ლოგირების ფრეიმვოკრი, კონფიდენციალურობაზე მორგებული და სტრუქტურირებული logging სისტემა, რომელიც გამოიყენება გამართვისა და დიაგნოსტიკისთვის.
 
 ეფექტურობა: OSLog შექმნილია იმისათვის, რომ იყოს ეფექტური, რაც იმას ნიშნავს, რომ ის მინიმალურ გავლენას ახდენს თქვენი აპლიკაციის წარმადობაზე მაშინაც კი, როდესაც ჩართულია ვრცელი ლოგირება.
 
 ქვესისტემა და კატეგორია: OSLog წარმოგიდგენთ ქვესისტემისა და კატეგორიის ცნებებს ლოგირების შეტყობინებების ორგანიზებისთვის. ქვესისტემა წარმოადგენს თქვენი აპლიკაციის უფრო დიდ კომპონენტს, ხოლო კატეგორია შემდგომში ანაწილებს ლოგირების შეტყობინებებს.
 */
