//
//  UserDefaultsExample.swift
//  DataPersistenceOptions
//
//  Created by Nino Kurshavishvili on 25.06.25.
//

//რა არის UserDefaults

/*
 UserDefaults - არის მარტივი და მსუბუქი მონაცემთა შენახვის მექანიზმი. როდესაც მცირე რაოდენობით მონაცემების შენახვა გჭირდება მაგალითად Preference-ბი ან აპლიკაციის seting-ები, UserDefault- მარტივი და მოსახერხებელი ვარიანტია ასეთი დატას შენახვისთვის.
 
 ის მონაცემთა შესანახად გვთვაზობს key-value წყვილის მიდგომას. UserDefault- გამოიყენება მხოლოდ არასენსიტიური ინფორმაციაების შესანახად, და არ არის შესაფერისი დიდი მონაცემების ან დიდი სტრუქტურული ობიექტების შესანახად (ამისთვის CoreData არის უფრო გამოსადეგი).
 
 დადებითი ნაწილი: 1) სიმარტივე - არის მარიტივი გამოსაყენებელი და აქვს მარტივი სინტაქსი, რაც მას იდეალურს ხდის მარტივად სტრუქტურირებული მონაცემების შესანახად.
 2) მდგრადობა - UserDefault-ში შენახული მონაცემები შენარჩუნებულია აპლიკაციის გაშვებასა და მოწყობილობის გადატვირთვის შემდეგაც.
 3) UserDefault- არ ეყრდნობა გარე ბიბლიოთეკებს ან ფრეიმვორკებს ის არის Build In feature.
 
 */
